app/controllers/comments_controller.rb

	def create
    @post = Post.find(params[:post_id])
    @comment = @post.comments.create(params[:comment])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "1"]]
INSERT INTO "comments" ("body", "commenter", "created_at", "post_id", "updated_at") VALUES (?, ?, ?, ?, ?)  [["body", "Body of the comment\r\n"], ["commenter", "Somebody else"], ["created_at", Sun, 24 Mar 2013 17:14:31 UTC +00:00], ["post_id", 1], ["updated_at", Sun, 24 Mar 2013 17:14:31 UTC +00:00]]