app/controllers/posts_controller.rb

INSERT INTO "posts" ("closed", "content", "created_at", "email", "name", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "posts" SET "name" = 'Somebody There', "updated_at" = '2013-03-24 17:32:09.731988' WHERE "posts"."id" = 1
---
  def update
    @post = Post.find(params[:id])

    respond_to do |format|
      if @post.update_attributes(params[:post])

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "posts" SET "closed" = 't', "updated_at" = '2013-03-29 11:06:36.359316' WHERE "posts"."id" = 1
---
	def close
    @post = Post.find(params[:id])
    @post.closed = true

    respond_to do |format|
      if @post.update_attributes(params[:post])

DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 3]]
---
	def destroy_multiple

		Comment.destroy(params[:comments])